0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
#include "stm32f10x.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "Delay.h"
#include "Motor.h"
#include "Sensor.h"
#include "mpu6050.h"
#include "twin_control_protocol.h"
#include "esp_runtime_transport.h"
#include "uart_ring.h"
#include "motor_register_diag.h"
#include "imu_diagnostic.h"
#include "diag_one_shot.h"
#include "send_response_parser.h"
#include "cipsend_transaction.h"
#include "cipsend_tx.h"
#include "tx_frame_queue.h"
#include "esp_tx_coordinator.h"
#include "mono_time.h"
#include "mono_time_core.h"
#include "health_stats.h"
#include "health_frame.h"
#include "health_watchdog.h"
#include "telemetry_batch.h"
#include "telemetry_delivery.h"
#include "telemetry_rate.h"
#include "timing_diagnostic.h"

/******************************************************************************
 * ESP01S WiFi (TCP Server)
 ******************************************************************************/
#define WIFI_SSID   "@Ruijie-sC384"
#define WIFI_PWD    "xiang87777114"
#define TCP_PORT    8888

/* ClockSync-only UDP isolation experiment.  These are experiment settings,
   not a migration of the existing TCP telemetry/control endpoint. */
#define CLOCK_SYNC_UDP_PC_IP       "192.168.110.89"
#define CLOCK_SYNC_UDP_PC_PORT     9999
#define CLOCK_SYNC_UDP_LOCAL_PORT  9998

static volatile uint8_t g_tcp_client_id = 0xFF;
static volatile uint8_t g_tcp_client_connected = 0;

static void USART1_Init(uint32_t baud)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE);
    GPIO_InitTypeDef gpio;
    gpio.GPIO_Pin = GPIO_Pin_9;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &gpio);
    gpio.GPIO_Pin = GPIO_Pin_10;
    gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &gpio);
    USART_InitTypeDef usart;
    usart.USART_BaudRate = baud;
    usart.USART_WordLength = USART_WordLength_8b;
    usart.USART_StopBits = USART_StopBits_1;
    usart.USART_Parity = USART_Parity_No;
    usart.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    usart.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
    USART_Init(USART1, &usart);
    USART_Cmd(USART1, ENABLE);
}

static void ESP_Send(const char *cmd)
{
    while (*cmd) {
        while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
        USART_SendData(USART1, *cmd++);
    }
    while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
    USART_SendData(USART1, '\r');
    while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
    USART_SendData(USART1, '\n');
}

static void ESP_Flush(void)
{
    uint32_t t;
    for (t = 0; t < 200; t++) {
        if (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) != RESET) {
            /* Preserve setup-phase CONNECT/CLOSED lines so the transport
               does not have to infer link state from a sent CIPSTART. */
            (void)esp_transport_process_byte(
                (uint8_t)USART_ReceiveData(USART1));
        }
    }
}

#define STR(x) _STR(x)
#define _STR(x) #x

static void ESP_MarkDisconnected(void);

static void ESP_Setup(void)
{
    ESP_Flush();
    ESP_Send("AT");                    Delay_ms(1500);  ESP_Flush();
    ESP_Send("AT+CWMODE=1");           Delay_ms(1500);  ESP_Flush();
    ESP_Send("AT+CWJAP=\"" WIFI_SSID "\",\"" WIFI_PWD "\"");
                                       Delay_ms(10000); ESP_Flush();
    ESP_Send("AT+CIPMUX=1");           Delay_ms(1500);  ESP_Flush();
    ESP_Send("AT+CIPMODE=0");           Delay_ms(500);   ESP_Flush();
    ESP_Send("AT+CIPSERVER=1," STR(TCP_PORT));
                                       Delay_ms(1500);  ESP_Flush();
    ESP_Send("AT+CIPSTART=" STR(ESP_CLOCK_SYNC_UDP_LINK_ID)
             ",\"UDP\",\"" CLOCK_SYNC_UDP_PC_IP "\","
             STR(CLOCK_SYNC_UDP_PC_PORT) ","
             STR(CLOCK_SYNC_UDP_LOCAL_PORT) ",0");
                                       Delay_ms(1500);  ESP_Flush();
    ESP_MarkDisconnected();
}

/******************************************************************************
 * 遥测帧 (二进制协议, 与 wifi_bridge.py 对接)
 * 帧格式: 0xAA 0x55 TYPE LEN [payload] XOR_CHECKSUM
 ******************************************************************************/
/* SPSC UART RX ring — ISR pushes, main loop pops (control input path). */
UartRing g_uart_ring;
/* SPSC UART TX ring — main loop pushes, ISR pops (non-blocking TX). */
UartRing g_uart_tx_ring;
static uint8_t g_prev_connected = 0;

/* Retry buffers for critical A (ACK) and S (status) frames, scoped to the
   current connection generation (tx_frame_queue.h).  After a failed CIPSEND
   transaction, the frame is preserved here (not consumed from the transport
   layer retry buffer) so it can be retried on the next main-loop iteration.
   Telemetry and diagnostic frames are NOT retried — only A/S frames.
   On a new CONNECT (generation change) or a CLOSED terminal result, all
   retained frames are dropped so old critical frames are never sent to a
   new client (Task 4B-4 fix, Codex review remediation). */
static TxFrameQueue g_tx_queue;

/* Diagnostic one-shot state machine: arms exactly once on each transition
   from motion-inhibited to running.  Declared at file scope so both the
   inhibited branch and the running branch can update it. */
static DiagOneShot g_diag_state;

/* ── Task 4B-4 fix: 非阻塞 CIPSEND TX 状态机 ─────────────────────────
   CIPSEND 从同步阻塞 while 改为持久化非阻塞状态机（cipsend_tx.h）。
   同一时间只允许一个事务；每次主循环由 ESP_TX_Service 推进一小步。
   A/S 为高优先级可靠帧（重试缓冲）；telemetry/diag 可丢。 */

static CipsendTx g_cipsend_tx;

/* ── Task 4B-4 final fix: TX connection-boundary coordinator ──────────
   Single call site for all boundary-abort decisions.  Ensures no byte
   from the old connection epoch reaches the ESP UART after a new client
   CONNECTs.  See esp_tx_coordinator.h and tx_boundary_design_decision.md. */
static EspTxCoordinator g_coordinator;

/* ── Health baseline: 0x02 健康统计（主上下文单写者）。 ──────────────── */
static HealthStats g_health_stats;
static uint8_t g_reset_cause = 0U;      /* RCC->CSR 复位原因快照（开机读+清 RMVF） */
static uint32_t s_last_health_ms = 0U;  /* 1Hz health_emit 上次发射时刻 */
static uint8_t  s_health_frame[HEALTH_FRAME_TOTAL_LEN]; /* 延迟待发的 0x02 健康帧 */
static uint32_t s_last_tx_generation = 0U; /* 上次看到的连接代次（发送仲裁） */

