0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
/* TX-ring discard callback for the coordinator: disable TXE, drain the
   ring, leave TXE disabled.  uart_tx_sink re-enables TXE on next push.
   Returns the number of bytes discarded (observable). */
static uint16_t discard_tx_ring_cb(void *ctx)
{
    uint8_t dummy;
    uint16_t discarded = 0U;
    (void)ctx;
    USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
    while (uart_ring_pop(&g_uart_tx_ring, &dummy)) {
        discarded++;
    }
    return discarded;
}

/* 遥测交付槽：pending 保留待确认数据，inflight 保留当前 CIPSEND 副本。 */
static uint8_t s_tele_frame[TELEMETRY_BATCH_FRAME_SIZE];
static TelemetryDelivery s_tele_delivery;
/* Droppable TX is released only after the current sensor/control phase. */
static uint8_t s_control_cycle_ready;
/* Keep the boot-time IMU identity observable until an existing client accepts
   one diagnostic frame. */
static uint8_t s_imu_diag_pending = 1U;
static TwinControlClockSync s_clock_sync_inflight;
static EspClockQuietWindow s_clock_quiet;

/* 真实单调时间（mono_time.h / mono_time_core.h）。 */
static uint32_t s_last_telemetry_ms = 0U;
static uint32_t s_last_yaw_ms = 0U;

/* Timing diagnostic state. Stage timestamps travel beside each queued
   telemetry frame; only the latest completed batch is emitted at 1 Hz. */
static TelemetryTimingRecord s_timing_work;
static TimingDiagnosticSnapshot s_timing_report;
static uint32_t s_timing_sample_seq = 0U;
static uint16_t s_timing_batch_id = 0U;
static uint16_t s_timing_overwrite_total = 0U;
static uint32_t s_last_timing_diag_ms = 0U;
static uint8_t s_timing_diag_pending = 0U;
static uint8_t s_timing_diag_inflight = 0U;
static uint8_t s_timing_telemetry_inflight = 0U;
static uint8_t s_capability_response_inflight = 0U;

#define TIMING_DIAGNOSTIC_PERIOD_MS 1000U

/* yaw dt 边界保护（ms）：零 dt 钳到 min，异常大间隔钳到 max。 */
#define YAW_DT_MIN_MS  1U
#define YAW_DT_MAX_MS  100U

/* UART TX 字节 sink：压入 TX ring 并启用 TXE 中断（非阻塞）。 */
static uint8_t uart_tx_sink(void *ctx, uint8_t byte)
{
    (void)ctx;
    if (!uart_ring_push(&g_uart_tx_ring, byte)) return 0U;
    USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
    return 1U;
}

static void ESP_ServiceCapabilityDiagnostic(void);

static uint8_t fill_clock_sync_payload(uint8_t *data, uint16_t *data_len,
                                       uint16_t capacity, uint32_t now_ms,
                                       void *ctx)
{
    TwinControlClockSync *clock_sync = (TwinControlClockSync *)ctx;
    uint16_t reserved_len;
    uint16_t encoded_len;
    if (data == 0 || data_len == 0 || clock_sync == 0) return 0U;
    reserved_len = *data_len;
    if (reserved_len != TWIN_CONTROL_CLOCK_SYNC_FRAME_LEN) return 0U;
    encoded_len = twin_control_encode_clock_sync_fixed(
        clock_sync, now_ms, (char *)data, capacity);
    return (encoded_len == reserved_len) ? 1U : 0U;
}

static void clear_telemetry_batch_cb(void *ctx)
{
    telemetry_delivery_clear((TelemetryDelivery *)ctx);
}

static void build_cipsend_cmd(char *cmd, uint16_t len)
{
    sprintf(cmd, "AT+CIPSEND=%d,%d\r\n", (int)g_tcp_client_id, (int)len);
}

static void build_cipsend_cmd_for_link(char *cmd, uint8_t link_id,
                                       uint16_t len)
{
    sprintf(cmd, "AT+CIPSEND=%d,%d\r\n", (int)link_id, (int)len);
}

static void ESP_MarkDisconnected(void)
{
    g_tcp_client_id = 0xFF;
    g_tcp_client_connected = 0;
    esp_clock_quiet_reset(&s_clock_quiet);
    s_capability_response_inflight = 0U;
    hstats_health_epoch_changed(&g_health_stats);  /* 断连 → 放弃待发健康帧 */
    twin_control_timeout();
}

/* 终态处理：成功清对应重试缓冲；ERROR/busy/超时保留（同代次内重试）；
   CLOSED 丢弃全部保留帧 + 强制 abort TX ring（连接已断，不得泄漏到
   下一连接）。等下一个 CONNECT 到来时 coordinator 会再做完整边界清理。 */
static void ESP_TX_HandleTerminal(void)
{
    uint8_t terminal_tag = CIPSEND_TX_TAG_NONE;
    uint8_t terminal_result = CTS_RESULT_NONE;
    uint32_t terminal_now_ms;

    /* Starting CIPSEND is not delivery evidence; wait for SEND OK. */
    if (cipsend_tx_is_terminal(&g_cipsend_tx)) {
        terminal_tag = cipsend_tx_tag(&g_cipsend_tx);
        terminal_result = cipsend_tx_result(&g_cipsend_tx);
    }

    terminal_now_ms = mono_now_ms();

    /* Capture telemetry delivery timestamps before the coordinator can clear
       an in-flight batch on a CLOSED boundary. */
    if (terminal_tag == CIPSEND_TX_TAG_TELEMETRY
        && s_timing_telemetry_inflight) {
        if (terminal_result == CTS_RESULT_OK) {
            telemetry_delivery_mark_inflight_send_ok(&s_tele_delivery,
                                                     terminal_now_ms);
            s_timing_report.t_send_ok_ms = terminal_now_ms;
            s_timing_report.flags |= TIMING_DIAGNOSTIC_FLAG_SEND_OK;
        }
        s_timing_report.flags |= TIMING_DIAGNOSTIC_FLAG_TX_TERMINAL;
        s_timing_telemetry_inflight = 0U;
        if (terminal_result != CTS_RESULT_CLOSED) {
            s_timing_diag_pending = 1U;
        }
    }

    /* Delegates to the extracted pure-logic function in esp_tx_coordinator,
       which is Host-testable via the same production code path.  See
       tx_boundary_design_decision.md §4 and §9. */
    etc_handle_terminal(&g_coordinator, terminal_now_ms);

    /* Only SEND OK commits the in-flight telemetry prefix.  Error/timeout
       leaves it owned by telemetry_delivery for a same-connection retry;
       CLOSED has already cleared it through the coordinator callback. */
    if (terminal_tag == CIPSEND_TX_TAG_TELEMETRY
        && terminal_result == CTS_RESULT_OK) {
        telemetry_delivery_commit_success(&s_tele_delivery);
    } else if (terminal_tag == CIPSEND_TX_TAG_TELEMETRY
               && terminal_result != CTS_RESULT_CLOSED) {
        telemetry_delivery_retain_failure(&s_tele_delivery);
    }

    /* A pending clock sample remains retryable until the fixed-length
       response receives SEND OK.  Command acceptance, prompt receipt, and
       payload preparation are not delivery evidence. */
    if (terminal_tag == CIPSEND_TX_TAG_CLOCK_SYNC
        && terminal_result == CTS_RESULT_OK) {
        esp_transport_consume_pending_clock_sync();
    }

    if (imu_diagnostic_delivery_confirmed(terminal_tag, terminal_result)) {
        s_imu_diag_pending = 0U;
    }

    if (terminal_tag == CIPSEND_TX_TAG_TIMING_DIAGNOSTIC) {
        s_timing_diag_inflight = 0U;
        if (terminal_result != CTS_RESULT_OK
            && terminal_result != CTS_RESULT_CLOSED) {
            s_timing_diag_pending = 1U;
        }
    }

    if (terminal_tag == CIPSEND_TX_TAG_DIAG &&
        s_capability_response_inflight) {
        if (terminal_result == CTS_RESULT_OK) {
            esp_transport_diagnostic_consume_response();
        }
        s_capability_response_inflight = 0U;
    }
}

