0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
/* Phase 1: drain RX ring, route every byte to both the transport
   (CONNECT/CLOSED/+IPD) and the TX state machine ('>' / SEND OK parse). */
static void ESP_ServiceRX(void)
{
    uint8_t ch;
    while (uart_ring_pop(&g_uart_ring, &ch)) {
        esp_transport_set_now_ms(mono_now_ms());
        esp_transport_process_byte(ch);        /* CONNECT/CLOSED/+IPD 输入路径 */
        cipsend_tx_feed_byte(&g_cipsend_tx, ch); /* TX 事务 '>' / SEND OK 解析 */
    }
}

/* Phase 2+3: check connection boundary, then push TX + handle terminal.
   Must run AFTER ESP_ServiceRX (which may have detected CONNECT/CLOSED)
   but BEFORE any main-loop logic that reads connection state. */
static void ESP_ServiceTX(void)
{
    uint32_t gen;
    /* Check boundary BEFORE pushing any TX bytes (see design decision §5).
       If a CONNECT arrived during ESP_ServiceRX, the coordinator discards
       the old CipsendTx, TX ring, tele slot, and A/S retry buffers so no
       old-epoch byte can reach the ESP. */
    (void)etc_check_boundary(&g_coordinator,
                             esp_transport_connection_generation(),
                             mono_now_ms());
    /* 连接代次变化 → 放弃旧代次待发健康帧（发送仲裁，不得发给新客户端）。 */
    gen = esp_transport_connection_generation();
    if (gen != s_last_tx_generation) {
        s_last_tx_generation = gen;
        esp_clock_quiet_reset(&s_clock_quiet);
        s_capability_response_inflight = 0U;
        hstats_health_epoch_changed(&g_health_stats);
    }
    if (esp_transport_take_clock_sync_event()) {
        esp_clock_quiet_arm(&s_clock_quiet, mono_now_ms());
    }
    if (!g_tcp_client_connected || g_tcp_client_id > 4U) {
        esp_clock_quiet_reset(&s_clock_quiet);
    }
    cipsend_tx_tick(&g_cipsend_tx, mono_now_ms(), uart_tx_sink, NULL);
    ESP_TX_HandleTerminal();
    ESP_ServiceCapabilityDiagnostic();
}

/* 构建 31 字节遥测帧到 s_tele_frame（兼容旧 payload 布局）。 */
static void build_telemetry_frame(int16_t s0, int16_t s1, int16_t s2, int16_t s3,
                                   int16_t m1, int16_t m2, int16_t m3, int16_t m4,
                                   int16_t error, int16_t pid_output,
                                   uint32_t tick, int32_t yaw,
                                   uint8_t imu_validity)
{
    uint8_t type = 0x01;
    uint8_t len  = 26;
    uint8_t cs   = type ^ len;
    uint8_t i;
    int32_t yaw_int = yaw;

    s_tele_frame[4]  = (uint8_t)(s0 & 0xFF);
    s_tele_frame[5]  = (uint8_t)(s1 & 0xFF);
    s_tele_frame[6]  = (uint8_t)(s2 & 0xFF);
    s_tele_frame[7]  = (uint8_t)(s3 & 0xFF);
    s_tele_frame[8]  = (uint8_t)(m1 & 0xFF);        s_tele_frame[9]  = (uint8_t)((m1 >> 8) & 0xFF);
    s_tele_frame[10] = (uint8_t)(m2 & 0xFF);        s_tele_frame[11] = (uint8_t)((m2 >> 8) & 0xFF);
    s_tele_frame[12] = (uint8_t)(m3 & 0xFF);        s_tele_frame[13] = (uint8_t)((m3 >> 8) & 0xFF);
    s_tele_frame[14] = (uint8_t)(m4 & 0xFF);        s_tele_frame[15] = (uint8_t)((m4 >> 8) & 0xFF);
    s_tele_frame[16] = (uint8_t)(error & 0xFF);     s_tele_frame[17] = (uint8_t)((error >> 8) & 0xFF);
    s_tele_frame[18] = (uint8_t)(pid_output & 0xFF);s_tele_frame[19] = (uint8_t)((pid_output >> 8) & 0xFF);
    s_tele_frame[20] = (uint8_t)(tick & 0xFF);
    s_tele_frame[21] = (uint8_t)((tick >> 8) & 0xFF);
    s_tele_frame[22] = (uint8_t)((tick >> 16) & 0xFF);
    s_tele_frame[23] = (uint8_t)((tick >> 24) & 0xFF);
    s_tele_frame[24] = (uint8_t)(yaw_int & 0xFF);
    s_tele_frame[25] = (uint8_t)((yaw_int >> 8) & 0xFF);
    s_tele_frame[26] = (uint8_t)((yaw_int >> 16) & 0xFF);
    s_tele_frame[27] = (uint8_t)((yaw_int >> 24) & 0xFF);
    s_tele_frame[28] = imu_validity;
    s_tele_frame[29] = MPU6050_GetInitStatus();

    for (i = 4; i < 30; i++) cs ^= s_tele_frame[i];

    s_tele_frame[0] = 0xAA;
    s_tele_frame[1] = 0x55;
    s_tele_frame[2] = type;
    s_tele_frame[3] = len;
    s_tele_frame[30] = cs;
}

static uint32_t telemetry_frame_tick_ms(const uint8_t *frame)
{
    if (frame == NULL) return 0U;
    return ((uint32_t)frame[20])
         | ((uint32_t)frame[21] << 8)
         | ((uint32_t)frame[22] << 16)
         | ((uint32_t)frame[23] << 24);
}

/* Build one low-rate report from the newest sample in the batch. The raw
   batch tick range still describes the whole payload sent in this transaction. */
static void timing_diag_fill_from_batch(
    TimingDiagnosticSnapshot *snapshot,
    const TelemetryBatch *batch,
    uint16_t batch_id,
    uint8_t pending_count,
    uint16_t overwrite_total,
    uint32_t tx_start_ms)
{
    const TelemetryTimingRecord *latest;
    const uint8_t *data;
    uint8_t count;

    if (snapshot == NULL || batch == NULL) return;
    memset(snapshot, 0, sizeof(*snapshot));
    count = telemetry_batch_count(batch);
    data = telemetry_batch_data(batch);
    if (count == 0U || data == NULL) return;

    latest = &batch->timing[count - 1U];
    snapshot->schema_version = TIMING_DIAGNOSTIC_SCHEMA_VERSION;
    snapshot->flags = TIMING_DIAGNOSTIC_FLAG_SAMPLE_VALID
                    | TIMING_DIAGNOSTIC_FLAG_TX_START;
    snapshot->batch_id = batch_id;
    snapshot->batch_count = count;
    snapshot->pending_count = pending_count;
    snapshot->overwrite_total = overwrite_total;
    snapshot->t_imu_start_ms = latest->t_imu_start_ms;
    snapshot->t_imu_done_ms = latest->t_imu_done_ms;
    snapshot->t_sensor_done_ms = latest->t_sensor_done_ms;
    snapshot->t_state_ms = latest->t_state_ms;
    snapshot->t_enqueue_ms = latest->t_enqueue_ms;
    snapshot->t_tx_start_ms = tx_start_ms;
    snapshot->batch_first_tick_ms = telemetry_frame_tick_ms(data);
    snapshot->batch_last_tick_ms = telemetry_frame_tick_ms(
        data + (uint16_t)(count - 1U) * TELEMETRY_BATCH_FRAME_SIZE);
    snapshot->sample_seq = latest->sample_seq;
}

/* 尝试把待发遥测交给 TX 状态机（仅当空闲且无 critical 待发）。 */
static void ESP_TrySendTelemetry(void)
{
    char cmd[24];
    const TelemetryBatch *inflight;
    uint16_t batch_len;
    uint8_t pending_count;
    uint8_t dropped_count;
    uint8_t i;
    uint32_t tx_start_ms;
    if (!telemetry_delivery_has_data(&s_tele_delivery)) return;
    if (esp_transport_diagnostic_busy()) return;
    if (esp_clock_quiet_active(&s_clock_quiet, mono_now_ms())) return;
    if (hstats_health_due(&g_health_stats)) return;  /* 健康帧优先：让行（仲裁） */
    if (cipsend_tx_busy(&g_cipsend_tx)) return;
    if (twin_control_has_pending_status()) return;
    if (!etc_telemetry_dispatch_allowed(
            s_control_cycle_ready,
            txfq_has_retry(&g_tx_queue),
            esp_transport_has_pending_ack(),
            esp_transport_has_pending_status(),
            twin_control_has_pending_status())) {
        return;  /* A/S 优先, including frames queued later this loop */
    }
    if (!telemetry_delivery_prepare_latest(&s_tele_delivery,
                                           &dropped_count)) return;
    for (i = 0U; i < dropped_count; i++) {
        hstats_telemetry_overwritten(&g_health_stats);
        if (s_timing_overwrite_total != 0xFFFFU) {
            s_timing_overwrite_total++;
        }
    }
    inflight = telemetry_delivery_inflight(&s_tele_delivery);
    if (inflight == NULL) return;
    batch_len = telemetry_batch_length(inflight);
    pending_count = telemetry_batch_count(&s_tele_delivery.pending);
    build_cipsend_cmd(cmd, batch_len);
    tx_start_ms = mono_now_ms();
    if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                         telemetry_batch_data(inflight), batch_len,
                         CIPSEND_TX_PRIORITY_DROPPABLE, CIPSEND_TX_TAG_TELEMETRY,
                         tx_start_ms)) {
        telemetry_delivery_mark_inflight_tx_start(&s_tele_delivery,
                                                  tx_start_ms);
        s_timing_batch_id++;
        timing_diag_fill_from_batch(&s_timing_report, inflight,
                                    s_timing_batch_id, pending_count,
                                    s_timing_overwrite_total, tx_start_ms);
        s_timing_telemetry_inflight = 1U;
        hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_TELEMETRY,
                          tx_start_ms);
    }
}

/* 遥测入队（pending FIFO）：由 ESP_TrySendTelemetry 择机批量发送。
   tick 为帧生成边界采集的真实单调毫秒（mono_now_ms），不等同于传感器采样时刻。 */
static void Telemetry_Queue(int16_t s0, int16_t s1, int16_t s2, int16_t s3,
                            int16_t m1, int16_t m2, int16_t m3, int16_t m4,
                            int16_t error, int16_t pid_output,
                            int32_t yaw,
                            uint8_t imu_validity)
{
    uint32_t generation_tick_ms;
    TelemetryTimingRecord timing;
    uint8_t overwrote;
    if (!g_tcp_client_connected || g_tcp_client_id > 4) {
        telemetry_delivery_clear(&s_tele_delivery);
        return;
    }
    generation_tick_ms = mono_now_ms();
    timing = s_timing_work;
    timing.t_state_ms = generation_tick_ms;
    timing.t_enqueue_ms = 0U;
    timing.t_tx_start_ms = 0U;
    timing.t_send_ok_ms = 0U;
    timing.sample_seq = ++s_timing_sample_seq;
    build_telemetry_frame(s0, s1, s2, s3, m1, m2, m3, m4,
                          error, pid_output, generation_tick_ms,
                          yaw, imu_validity);
    if (telemetry_delivery_append_timed(
            &s_tele_delivery, s_tele_frame,
            TELEMETRY_BATCH_FRAME_SIZE, &timing, &overwrote)) {
        telemetry_delivery_mark_last_pending_enqueue(&s_tele_delivery,
                                                     mono_now_ms());
        hstats_telemetry_generated(&g_health_stats);
        if (overwrote) {
            hstats_telemetry_overwritten(&g_health_stats);
            if (s_timing_overwrite_total != 0xFFFFU) {
                s_timing_overwrite_total++;
            }
        }
        ESP_TrySendTelemetry();
    }
}

/* 发送二进制诊断帧。0x7E 旧诊断帧可丢弃；0x7D IMU 身份诊断帧和
   0x7F 时序诊断帧走独立 tag。若 TX 忙则本次放弃。
   Health baseline: 0x02 健康帧走 CIPSEND_TX_TAG_DIAG_HEALTH（专属归属）；
   0x7E 旧诊断帧仍走 CIPSEND_TX_TAG_DIAG。返回是否成功开启事务（start
   成功处触发 hstats_tx_started；失败由调用方记 health_dropped）。 */
static uint8_t ESP_SendDiagFrame(const uint8_t *frame, uint16_t frame_len)
{
    uint8_t tag;
    uint8_t started;
    char cmd[24];
    uint32_t start_ms;
    if (!g_tcp_client_connected || g_tcp_client_id > 4) return 0U;
    if (esp_transport_diagnostic_busy()) return 0U;
    if (esp_clock_quiet_active(&s_clock_quiet, mono_now_ms())) return 0U;
    if (cipsend_tx_busy(&g_cipsend_tx)) return 0U;
    if (twin_control_has_pending_status()) return 0U;
    if (txfq_has_retry(&g_tx_queue)) return 0U;
    if (esp_transport_has_pending_ack()
        || esp_transport_has_pending_status()) return 0U;
    if (frame_len >= 4U && frame[2] == HEALTH_FRAME_TYPE) {
        tag = CIPSEND_TX_TAG_DIAG_HEALTH;
    } else if (frame_len >= 4U && frame[2] == IMU_DIAGNOSTIC_TYPE) {
        tag = CIPSEND_TX_TAG_IMU_DIAGNOSTIC;
    } else if (frame_len >= 4U && frame[2] == TIMING_DIAGNOSTIC_TYPE) {
        tag = CIPSEND_TX_TAG_TIMING_DIAGNOSTIC;
    } else {
        tag = CIPSEND_TX_TAG_DIAG;
    }
    build_cipsend_cmd(cmd, frame_len);
    start_ms = mono_now_ms();
    started = cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                               frame, frame_len,
                               CIPSEND_TX_PRIORITY_DROPPABLE, tag,
                               start_ms);
    if (started) {
        hstats_tx_started(&g_health_stats, tag, start_ms);
    }
    return started;
}

/* Capability preflight scheduler.  It sends only the four compile-time
   whitelist commands through the existing UART TX ring, and returns each
   completed response through the existing CIPSEND transaction. */
static void ESP_ServiceCapabilityDiagnostic(void)
{
    const char *command;
    const char *query_id;
    uint16_t command_len;
    uint16_t i;
    uint32_t now_ms;
    uint8_t critical_pending;
    char response[CIPSEND_TX_MAX_DATA];
    uint16_t response_len;
    char cmd[CIPSEND_TX_MAX_CMD];

    now_ms = mono_now_ms();
    esp_transport_diagnostic_tick(now_ms);

