0hello-bit/Robot_twin/数字孪生/firmware/stm32_line_follower/User/main.c
    if (!g_tcp_client_connected || g_tcp_client_id > 4U) {
        s_capability_response_inflight = 0U;
        return;
    }

    if (esp_transport_diagnostic_request_ready()) {
        critical_pending = (uint8_t)(
            txfq_has_retry(&g_tx_queue) ||
            esp_transport_has_pending_ack() ||
            esp_transport_has_pending_status() ||
            twin_control_has_pending_status() ||
            esp_transport_has_pending_clock_sync());
        (void)esp_transport_start_diagnostic(
            now_ms, g_tcp_client_connected,
            twin_control_motion_inhibited(),
            (uint8_t)!cipsend_tx_busy(&g_cipsend_tx),
            critical_pending);
    }

    if (s_capability_response_inflight) return;

    critical_pending = (uint8_t)(
        txfq_has_retry(&g_tx_queue) ||
        esp_transport_has_pending_ack() ||
        esp_transport_has_pending_status() ||
        twin_control_has_pending_status() ||
        esp_transport_has_pending_clock_sync());
    if (critical_pending) return;

    if (esp_transport_diagnostic_response_ready()) {
        if (cipsend_tx_busy(&g_cipsend_tx)) return;
        response_len = esp_transport_diagnostic_peek_response(
            response, sizeof(response));
        if (response_len == 0U) return;
        build_cipsend_cmd(cmd, response_len);
        if (cipsend_tx_start(
                &g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                (const uint8_t *)response, response_len,
                CIPSEND_TX_PRIORITY_DROPPABLE, CIPSEND_TX_TAG_DIAG,
                now_ms)) {
            s_capability_response_inflight = 1U;
            hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_DIAG, now_ms);
        }
        return;
    }

    if (!esp_transport_diagnostic_command(&command, &command_len, &query_id)) {
        return;
    }
    if (!g_tcp_client_connected || g_tcp_client_id > 4U ||
        cipsend_tx_busy(&g_cipsend_tx)) return;
    (void)query_id;
    for (i = 0U; i < command_len; ++i) {
        if (!uart_tx_sink(NULL, (uint8_t)command[i])) break;
        esp_transport_diagnostic_mark_command_byte_sent(now_ms);
    }
    if (i == command_len) {
        /* Retain the explicit whole-command hook for source-level contract
           clarity; the byte-progress API has already marked it complete. */
        esp_transport_diagnostic_mark_command_sent(now_ms);
    }
}

static void ESP_TrySendImuDiagnostic(void)
{
    ImuDiagnosticSnapshot snapshot;
    uint8_t frame[IMU_DIAGNOSTIC_FRAME_SIZE];

    if (!s_imu_diag_pending) return;

    snapshot.observed_id = MPU6050_GetObservedID();
    snapshot.init_status = MPU6050_GetInitStatus();
    snapshot.validity_flags = MPU6050_GetValidityFlags();
    snapshot.hardware_observed_id = MPU6050_GetHardwareObservedID();
    imu_diagnostic_encode(frame, &snapshot);

    /* Keep the pending flag on a busy/disconnected/blocked transport so the
       identity is still sent when the existing client path becomes idle. */
    (void)ESP_SendDiagFrame(frame, IMU_DIAGNOSTIC_FRAME_SIZE);
}

/* Emit at most one timing report per second so the experiment does not turn
   the diagnostic stream into another source of persistent queue pressure. */
static void ESP_TrySendTimingDiagnostic(void)
{
    uint32_t now_ms;
    uint8_t frame[TIMING_DIAGNOSTIC_FRAME_SIZE];

    if (!s_timing_diag_pending || s_timing_diag_inflight) return;
    now_ms = mono_now_ms();
    if ((uint32_t)(now_ms - s_last_timing_diag_ms)
            < TIMING_DIAGNOSTIC_PERIOD_MS) {
        return;
    }
    timing_diagnostic_encode(frame, &s_timing_report);
    if (ESP_SendDiagFrame(frame, TIMING_DIAGNOSTIC_FRAME_SIZE)) {
        s_last_timing_diag_ms = now_ms;
        s_timing_diag_pending = 0U;
        s_timing_diag_inflight = 1U;
    }
}

/* 发送队列（非阻塞）：ACK → STATUS → telemetry，严格串行。
   每次只尝试开启一个事务；失败时 critical 重试缓冲保留到下一轮。
   critical 帧的可靠性只在当前连接代次内保证：跨连接（代次改变 /
   CLOSED）时旧 ACK/STATUS 会被 txfq 丢弃，不会发给新客户端。 */
static void ESP_SendQueuedFrames(uint8_t allow_telemetry)
{
    char cmd[24];
    uint8_t ack_was_retained;
    uint8_t status_was_retained;
    uint8_t clock_sync_link_id = 0xFFU;
    uint8_t tcp_available = (g_tcp_client_connected && g_tcp_client_id <= 4U)
        ? 1U : 0U;
    uint8_t clock_sync_available =
        esp_transport_pending_clock_sync_sendable();

    if (!tcp_available && !clock_sync_available) return;
    if (cipsend_tx_busy(&g_cipsend_tx)) return;

    if (tcp_available) {
        /* --- ACK: retry existing or fetch new from transport ---
           Health baseline: 取新帧前 txfq_has_ack 已真 = 重发（上笔非 OK 终态）→
           hstats_ack_retry。 */
        ack_was_retained = txfq_has_ack(&g_tx_queue);
        if (!ack_was_retained && esp_transport_has_pending_ack()) {
            char tmp[TX_FRAME_QUEUE_LINE_MAX + 1U];
            uint16_t n = esp_transport_get_pending_ack(tmp, sizeof(tmp));
            txfq_retain_ack(&g_tx_queue, tmp, n);
        }
        if (txfq_has_ack(&g_tx_queue)) {
            if (ack_was_retained) hstats_ack_retry(&g_health_stats);
            build_cipsend_cmd(cmd, txfq_ack_len(&g_tx_queue));
            if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                                 (const uint8_t *)txfq_ack_ptr(&g_tx_queue),
                                 txfq_ack_len(&g_tx_queue),
                                 CIPSEND_TX_PRIORITY_CRITICAL, CIPSEND_TX_TAG_ACK,
                                 mono_now_ms())) {
                hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_ACK, mono_now_ms());
            }
            return;   /* 保持 ACK 顺序：STATUS 延后 */
        }

        /* --- STATUS: retry existing or fetch new from transport --- */
        status_was_retained = txfq_has_status(&g_tx_queue);
        if (!status_was_retained && esp_transport_has_pending_status()) {
            char tmp[TX_FRAME_QUEUE_LINE_MAX + 1U];
            uint16_t n = esp_transport_get_pending_status(tmp, sizeof(tmp));
            txfq_retain_status(&g_tx_queue, tmp, n);
        }
        if (txfq_has_status(&g_tx_queue)) {
            if (status_was_retained) hstats_status_retry(&g_health_stats);
            build_cipsend_cmd(cmd, txfq_status_len(&g_tx_queue));
            if (cipsend_tx_start(&g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                                 (const uint8_t *)txfq_status_ptr(&g_tx_queue),
                                 txfq_status_len(&g_tx_queue),
                                 CIPSEND_TX_PRIORITY_CRITICAL, CIPSEND_TX_TAG_STATUS,
                                 mono_now_ms())) {
                hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_STATUS, mono_now_ms());
            }
            return;
        }
    }

    /* --- Clock sync response: after safety frames, before telemetry --- */
    if (clock_sync_available &&
        esp_transport_pending_clock_sync_link_id(&clock_sync_link_id)) {
        uint32_t start_tick_ms = mono_now_ms();
        if (esp_transport_peek_pending_clock_sync(&s_clock_sync_inflight)) {
            uint16_t clock_sync_len = TWIN_CONTROL_CLOCK_SYNC_FRAME_LEN;
            build_cipsend_cmd_for_link(cmd, clock_sync_link_id,
                                       clock_sync_len);
            if (cipsend_tx_start_late_data(
                    &g_cipsend_tx, cmd, (uint16_t)strlen(cmd),
                    clock_sync_len, CIPSEND_TX_PRIORITY_CRITICAL,
                    CIPSEND_TX_TAG_CLOCK_SYNC, start_tick_ms,
                    fill_clock_sync_payload, &s_clock_sync_inflight)) {
                hstats_tx_started(&g_health_stats, CIPSEND_TX_TAG_CLOCK_SYNC,
                                  start_tick_ms);
            }
        }
        return;
    }

    /* --- Telemetry (latest-wins slot) --- */
    if (esp_transport_diagnostic_response_ready()) return;
    if (esp_transport_diagnostic_busy()) return;
    if (allow_telemetry) ESP_TrySendTelemetry();
}

